#include <iostream>
#include <numeric>
#include <cmath>
using namespace std;

using ll = long long;

int main()
{   
    // Главная логика это НОК(наименьшее общее кратное) можно выводить просто его
    // но только в большинстве случаев ведь есть корнер первый это когда одна из цифр это
    // один в этом случае ответ это квадрат другого числа не углубляясь можно сказать что у этого
    // квадрат 1 и другое число будут максимальными делителями второй корнер это то что 
    // второе число делится на первое в этом случае ответ это второе число умножить на их частное
    // ведь таким образом их частное становится в квадрате и как выше сказано число которое максимальный
    // делитель числа или предмаксимальный сохраняет роль и в квадрате этого числа
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--) {
        ll a, b;
        cin >> a >> b;
        if (a == 1) {
            cout << b*b << "\n";
            continue;
        }
        if (b % a == 0)cout << b * (b / a) << "\n";
        else cout << lcm(a, b) << "\n";
    }
}


