#include <iostream>
#include <vector>
using namespace std;

int main()
{
    // Эта задача строится на том что нам выгоднее сделать во первых мы
    // должны сделать первую строку как можно меньше ведь сделать её сложно
    // во вторых есть исключение а именно когда идёт сначала 1 а потом 3 вначале
    // нам выгодно забрать 3 ведь он может помешать второй при этом не испортит баланс первой
    // Зная это лучшая первая строка эта самая короткая а найдя её мы можем проверить
    // возможна ли вторая строка чтобы хотя бы один элемент для третьей остался
    int t;
    cin >> t;
    while (t--) {
        int n;
        cin >> n;
        vector<int> a(n);
        for (int i = 0; i < n; i++) {
            cin >> a[i];
        }
        int good = 0, bad = 0;
        int i;
        for (i = 0; i < n-1; i++) {
            if (a[i] < 2)good++;
            else bad++;
            if (bad - good < 1) {
                if (bad == 0 && a[i + 1] == 3)i++;
                break;
            }
        }
        good = bad = 0;
        for (i+=1; i < n; i++) {
            if (a[i] < 3)good++;
            else bad++;
            if (bad - good < 1) {
                break;
            }
        }
        cout << ((i < n - 1) ? "YES\n" : "NO\n");
    }
}


//2242B *1000
