#include <iostream>
#include <vector>
#include <cmath>
using namespace std;

int main()
{
    // Всё крутится вокруг логики того что n <= 100 очень мало
    // Нужно понять что вообще нужно чтобы знамения сошлись по порядку
    // это значит они должны строго возрастать также нам известно что наши знамения
    // происходят циклично это значит что мы можем подождать пока год нового знамения не превысит
    // год предыдущего из этого можно сделать просто алгоритм что мы крутим года до того момента пока они
    // не превысят прошлый год как уже упоминалось n безумно мал что позволяет нам сделать что-то подобное легко
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--) {
        int n;
        cin >> n;
        vector<int> a(n);
        for (int i = 0; i < n; i++) {
            cin >> a[i];
        }
        vector<int> ans(n);
        ans[0] = a[0];
        for (int i = 1; i < n; i++) {
            if (a[i] > ans[i - 1])ans[i] = a[i];
            else ans[i] = a[i] * (ans[i - 1] / a[i]+1);
        }
        cout << ans.back() << "\n";
    }
}


