#include <iostream>
using namespace std;

int main()
{
    // Подойти к этой задаче нужно с вопрос какое максимально продуктивное по битам
    // число мы можем получить которое будет менее k и тут есть концепция истинных чисел
    // это числа вида 1...1 одни лишь единицы и эти числа это всегда 2^n-1 то есть степени двойки
    // минус один и можно доказать что больше никакое число и даже никакая совокупность чисел
    // до k не сможет превзойти максимального истинного числа которое менее чем k 
    // Но есть нюанс это n = 1 в этом случае мы никаким образом не наберём k если не сделаем 
    // наш единственый элемент равным ему в иных же случаях ответ просто истинное число остаток чтобы
    // добрать k и просто нули чтобы добрать количество n
    ios::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--) {
        int n, k;
        cin >> n >> k;
        int max2 = 0;
        while (max2 * 2 + 1 <= k) {
            max2 = max2 * 2 + 1;
        }
        if (n == 1) {
            cout << k << "\n";
            continue;
        }
        cout << max2 << " " << k-max2 << " ";
        for (int i = 0; i < n - 2; i++) {
            cout << 0 << " ";
        }
        cout << "\n";

    }
}


