#include <iostream>
#include <vector>
#include <cmath>
#include <algorithm>
using namespace std;

using ll = long long;

int main()
{
    // Задача строится на базовых операциях сложения и вычитания поэтому насчёт доведения
    // элементов всё просто это их разность о чём даже можно не упоминать нас интересует
    // тот факт что мы должны как-то достать элемент через операцию копировани тут уже
    // базовые подходы не уместны поэтому нужно найти закономерность
    // Она заключается в том что есть один логичный чуть менее логичный и неординарный подход
    // логичный в том что наше число уже есть в массиве 'a' сложнее уже понять то
    // что иногда это число нужно получить через копирование не равного но при этом
    // наиближайшего элемента к нужному и уже после доведения его до нужного результа
    // и самый неочевидный это то что иногда нужно число может нас встретить при доведение
    // прочих чисел до чисел из 'b' то есть число которое нам нужно входит в их диапозон
    // по которому число проходит чтобы дойти до элемента из 'b'
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--) {
        int n;
        cin >> n;
        vector<ll> a(n);
        vector<ll> b(n+1);
        for (int i = 0; i < n; i++) {
            cin >> a[i];
        }
        for (int i = 0; i < n + 1; i++) {
            cin >> b[i];
        }
        const ll spec = b[n];
        ll dist = 1e10, sum = 0;
        bool easy = false;
        for (int i = 0; i < n; i++) {
            easy = max(((spec >= min(a[i], b[i]) && spec <= max(a[i], b[i])) 
                    || a[i] == spec), easy);
            dist = min({ dist,abs(spec - a[i]), abs(spec - b[i]) });
            sum += abs(a[i] - b[i]);
        }
        cout << ((easy) ? sum + 1 : sum + 1 + dist) << "\n";
    }
}


