#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

using ll = long long;

int main()
{
    // Самое базовое это то что операция эта только делает нечётные числа это самое банальное здесь
    // НО при этом она делает нечётным числом меньшее то есть чтобы сделать чётное нечётным
    // нам нужно иметь число нечётное которое будет более его также у нас нет лимита по
    // использованию чисел поэтому берём самое большое нечётное число и изменяем им все прочие
    // При этом тут уже поялвяются не совсем ординарная подножка для логики а именно в том
    // что когда мы делаем чётное нечётным то этим числом мы тоже можем пользоваться 
    // можно сказать даже больше мы обязаны им пользоваться ведь оно гарантированно более
    // нашего начального ведь представляет сумму где начальное только одно из слагаемых
    // Также придёт момень в большинтсве случаев когда наше нечётное даже с накопительным эффектом
    // описанным выше окажется менее одного из чётных тогда что нам мешает просто взять его
    // и максимальное чётное это сразу гарантирует то что наше нечётное будет более всех
    // чётных правда на это есть цена одного лишнего действия которое использовать в условиях
    // когда мы не встречаем большего чётного не будет уместным
    int t;
    cin >> t;
    while (t--) {
        int n,cou = 0;
        ll beg = -67;
        cin >> n;
        vector<ll> a;
        for (int i = 0; i < n; i++) {
            ll b; cin >> b;
            if (b % 2 == 0) {
                a.push_back(b);
            }
            else beg = max(beg, b);
        }
        if (a.empty() || beg == -67) {
            cout << 0 << '\n';
            continue;
        }
        sort(a.begin(), a.end());
        for (int i = 0; i < a.size(); i++) {
            if (beg > a[i])cou++, beg += a[i];
            else cou += 2, beg += a.back();
        }
        cout << cou << "\n";
    }
}


