#include <iostream>
#include <string>
#include <ranges>
using namespace std;

int main()
{
    // Суть этой задачи в том что нужно заметить особенности исключающего ИЛИ 
    // а именно что если в операции есть 0 то мы вообще никак не влияем на другое число
    // Также нужно заметить что сложное условие игры говорит только о том что 
    // мы сравниваем первый отрезок чисел с выбранным через XOR и если допустим
    // в самомо начале нули как вышесказано они никак не повлияют поэтому нам нужно найти
    // единицу котороый мы сможем манипулировать числами ведь она имеет противоположный
    // эффект а именно всегда меняет бит на обратный при этом если допустим до этой самой
    // единицы мы найдём число не соответствующее варианту из 't' то мы не сможем никак
    // на него повлиять это и есть исключение которое выводит отрицательный ответ 
    // соответственно в прочих случаях ответ всегда положительный
    int q;
    cin >> q;
    while (q--) {
        int n;
        cin >> n;
        string s, t;
        cin >> s >> t;
        bool issue = false, answer = true;
        if (s.find('1') == string::npos && s != t) {
            cout << "NO\n";
            continue;
        }
        for (auto [u, y] : views::zip(s, t)) {
            if (u == '1')issue = true;
            if (!issue && u != y)answer = false;
        }
        cout << ((answer) ? "YES\n" : "NO\n");
    }
}


