#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

using ll = long long;

int main()
{
    // Суть этой задачи это как у множества подобных заключается в
    // худшем сценарии его нужно разобрать сколько пар перчаток нужно вынуть
    // максимально чтобы не собрать ни одной пары ответ это максимальное 
    // число из каждой пары далее нам нужно собрать k пар чтобы сделать 
    // худший здесь у нас есть варианты оставшихся чисел и мы можем брать
    // каждый раз самые большие из них тем самым собирая как можно меньше пар разных цветов
    // Но тут есть небольшая деталь а именно мы могли брать все прошлые максимальные
    // до конца но вот с последним числом для пары есть исключение так как как только
    // мы возьмём одну перчатку из этого числа мы уже соберём k пар то есть не заберём 
    // число целиком поэтому мы берём k-1 самых больших и +1 с последней пары
    int t;
    cin >> t;
    while (t--) {
        int n,k;
        cin >> n >> k;
        vector<ll> l(n);
        vector<ll> r(n);
        for (int i = 0; i < n; i++) {
            cin >> l[i];
        }
        for (int i = 0; i < n; i++) {
            cin >> r[i];
            if (r[i] > l[i])swap(l[i],r[i]);
        }
        sort(r.begin(), r.end(), greater<ll>());
        ll sum = 0;
        for (int i = 0; i < n; i++) {
            sum += l[i];
        }
        for (int i = 0; i < k - 1; i++) {
            sum += r[i];
        }
        cout << sum+1 << "\n";
    }
}


//2096B *1100
