#include <iostream>
#include <vector>
#include <algorithm>
using namespace std;

using vv = vector<int>;

int main()
{
    // Суть задачи в том что у нас должна выполняться пара условий
    // Первое наше самое большое фибоначчи должно влезть целиком иначе у нас вообще нету шансов
    // Второе нужно уже подумать как нам нужно расположить кубики так чтоб они 
    // заняли наименьшее место этот вариант хорошо показн на картинке к задаче
    // он заключается в том что положить все кубики на одну сторону самого большого
    // можно доказать это базовым правилом золотого сечения(самый большой виток гарантированно больше предыдущих вместе)
    // Так вот прочие вариант размещения не корректны ведь так мы занимаем только + стороны
    // предмаксимального а в иных же случаях размещения мы получим + к лишнему рассотоянию
    // не только на предмаксимальный фибоначчи но в том же числе и на поставленный иначе фибоначчи
    // В это и заключается второе правило и гласит оно что 2 стороны ёмкости обязаны быть >= стороны
    // наибольшего фибоначчи КРОМЕ стороны на котороый мы будем размещать она должна быть >= сторонам
    // максимального и предмаксимального фибоначчи
    int t;
    cin >> t;
    while (t--) {
        int n,m;
        cin >> n >> m;
        vector<vv> a(m, vv(3));
        const vv fib = { 1,2,3,5,8,13,21,34,55,89 };
        for (int i = 0; i < m; i++) {
            cin >> a[i][0] >> a[i][1] >> a[i][2];
        }
        for (int i = 0; i < m; i++) {
            vv c = a[i];
            if (min({ c[0],c[1],c[2] }) < fib[n - 1]) {
                cout << 0;
                continue;
            }
            if (max({ c[0],c[1],c[2] }) < fib[n - 1] + fib[n - 2]) {
                cout << 0;
                continue;
            }
            cout << 1;
        }
        cout << "\n";
    }
}


//2111B *1100
