#include <iostream>
#include <algorithm>
#include <string>
#include <vector>
using namespace std;

int main()
{
    // Главный инсайт этой задачи в том что во первых Алиса может взять любые
    // числа в массиве и перевернуть их если они соответствуют невозрастанию
    // ходы можно делать вплоть до того момента пока не закончатся невозрастающие
    // подотрезки 
    // Подотрезки это те моменты которые создают числа которые также делают массив 
    // не отсортированным по не убыванию то есть непраивльные числа которые портят сортировку
    // их наличие создаёт подотрезки которыми в свою очередь могут воспользоваться Алиса и Боб
    // Если массив уже отсортирован ходов изначально нету из чего следует что проиграет Алиса
    // в ином же случае у неё есть варианты ходов её желание сделать за свой ход массив 
    // отсортированным
    // Чтобы это сделать Алиса должна перекинуть все единицы в конец а нули в начало 
    // а добиться этого не так уж и сложно  нам просто нужно находить единицы и нули
    // с начала и с конца соответственно и менять их местами 
    // Из этого следует что Алиса может за один свой ход сделать массив неубывающим 
    // тем самым лишив Боба ходов и выиграть и её первый выигрышный ход будет всегда последним
    // и её ход это последовательность перых елиниц и последних нулей чтобы поменять их местами
    int t;
    cin >> t;
    while (t--) {
        int n;
        cin >> n;
        string s;
        cin >> s;
        if (is_sorted(s.begin(), s.end())) {
            cout << "Bob\n";
            continue;
        }
        int L = 0, R = n-1;
        vector<int> ans;
        while (L < R) {
            while (s[L] != '1' && L < R)L++;
            while (s[R] != '0' && R > L)R--;
            if (L < R) {
                ans.push_back(L + 1);
                ans.push_back(R + 1);
                L++;
                R--;
            }
        }
        sort(ans.begin(), ans.end());
        cout << "Alice\n" << ans.size() << endl;;
        for (int i = 0; i < ans.size(); i++) {
            cout << ans[i] << " ";
        }
        cout << "\n";
    }
}

