#include <iostream>
#include <algorithm>
using namespace std;

int main()
{
    // Суть задачи заключается в паре кревых случаев один из них когда колбасы
    // больше нежели сыра что сразу -1 а второй менее очевидный если сыра слишком много
    // мы упрёмся в колбасу но сначала логика наш ответ это просто разность сыра и колбасы
    // ведь ровно столько сыра мы можем положить второй раз тем самым сыра станет больше
    // кроме как раз уже указанного случая когда колбасы мало тогда мы выводим колбасу ведь
    // она наше бутылочное горлышко
    int t;
    cin >> t;
    while (t--) {
        int a, b;
        cin >> a >> b;
        if (a <= b) {
            cout << -1 << '\n';
            continue;
        }
        cout << min(a - b,b) << "\n";
    }
}


